redis_benchmark/test/withKubearmor9_10000000.txt
====== GET ======
  10075304 requests completed in 5.45 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 27.023 milliseconds (cumulative count 1000)
50.000% <= 288.511 milliseconds (cumulative count 5004568)
75.000% <= 349.951 milliseconds (cumulative count 7511568)
87.500% <= 410.367 milliseconds (cumulative count 8757272)
93.750% <= 423.935 milliseconds (cumulative count 9380192)
96.875% <= 431.615 milliseconds (cumulative count 9688000)
98.438% <= 440.319 milliseconds (cumulative count 9844000)
99.219% <= 451.071 milliseconds (cumulative count 9924000)
99.609% <= 454.399 milliseconds (cumulative count 9963000)
99.805% <= 455.679 milliseconds (cumulative count 9981000)
99.902% <= 470.527 milliseconds (cumulative count 9991000)
99.951% <= 471.039 milliseconds (cumulative count 9998000)
99.988% <= 471.295 milliseconds (cumulative count 10000000)
100.000% <= 471.295 milliseconds (cumulative count 10000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 27.103 milliseconds (cumulative count 1000)
0.100% <= 28.111 milliseconds (cumulative count 10000)
0.230% <= 29.103 milliseconds (cumulative count 23000)
0.270% <= 30.111 milliseconds (cumulative count 27000)
0.290% <= 68.159 milliseconds (cumulative count 29000)
0.430% <= 69.119 milliseconds (cumulative count 43000)
0.590% <= 70.143 milliseconds (cumulative count 59000)
0.710% <= 71.103 milliseconds (cumulative count 71000)
0.850% <= 72.127 milliseconds (cumulative count 85000)
1.000% <= 73.151 milliseconds (cumulative count 100000)
1.140% <= 74.111 milliseconds (cumulative count 114000)
1.290% <= 75.135 milliseconds (cumulative count 129000)
1.420% <= 76.159 milliseconds (cumulative count 142000)
1.560% <= 77.119 milliseconds (cumulative count 156000)
1.710% <= 78.143 milliseconds (cumulative count 171000)
1.840% <= 79.103 milliseconds (cumulative count 184000)
1.920% <= 80.127 milliseconds (cumulative count 192000)
2.060% <= 81.151 milliseconds (cumulative count 206000)
2.200% <= 82.111 milliseconds (cumulative count 220000)
2.290% <= 83.135 milliseconds (cumulative count 229000)
2.390% <= 84.159 milliseconds (cumulative count 239000)
2.460% <= 85.119 milliseconds (cumulative count 246000)
2.590% <= 86.143 milliseconds (cumulative count 259000)
2.670% <= 87.103 milliseconds (cumulative count 267000)
2.710% <= 88.127 milliseconds (cumulative count 271000)
2.716% <= 143.103 milliseconds (cumulative count 271568)
2.784% <= 144.127 milliseconds (cumulative count 278384)
2.858% <= 145.151 milliseconds (cumulative count 285768)
2.914% <= 146.175 milliseconds (cumulative count 291448)
2.988% <= 147.199 milliseconds (cumulative count 298832)
3.056% <= 148.223 milliseconds (cumulative count 305648)
3.119% <= 149.119 milliseconds (cumulative count 311896)
3.193% <= 150.143 milliseconds (cumulative count 319280)
3.238% <= 151.167 milliseconds (cumulative count 323824)
3.306% <= 152.191 milliseconds (cumulative count 330640)
3.392% <= 153.215 milliseconds (cumulative count 339160)
3.465% <= 154.111 milliseconds (cumulative count 346544)
3.500% <= 155.135 milliseconds (cumulative count 349952)
3.568% <= 157.183 milliseconds (cumulative count 356768)
3.624% <= 158.207 milliseconds (cumulative count 362448)
3.693% <= 159.103 milliseconds (cumulative count 369264)
3.738% <= 160.127 milliseconds (cumulative count 373808)
3.786% <= 161.151 milliseconds (cumulative count 378568)
3.826% <= 177.151 milliseconds (cumulative count 382568)
3.956% <= 178.175 milliseconds (cumulative count 395568)
4.056% <= 179.199 milliseconds (cumulative count 405568)
4.186% <= 180.223 milliseconds (cumulative count 418568)
4.306% <= 181.119 milliseconds (cumulative count 430568)
4.436% <= 182.143 milliseconds (cumulative count 443568)
4.566% <= 183.167 milliseconds (cumulative count 456568)
4.696% <= 184.191 milliseconds (cumulative count 469568)
4.826% <= 185.215 milliseconds (cumulative count 482568)
4.886% <= 186.111 milliseconds (cumulative count 488568)
4.986% <= 187.135 milliseconds (cumulative count 498568)
5.116% <= 188.159 milliseconds (cumulative count 511568)
5.256% <= 189.183 milliseconds (cumulative count 525568)
5.396% <= 190.207 milliseconds (cumulative count 539568)
5.516% <= 191.103 milliseconds (cumulative count 551568)
5.666% <= 192.127 milliseconds (cumulative count 566568)
5.806% <= 193.151 milliseconds (cumulative count 580568)
5.956% <= 194.175 milliseconds (cumulative count 595568)
6.096% <= 195.199 milliseconds (cumulative count 609568)
6.206% <= 196.223 milliseconds (cumulative count 620568)
6.296% <= 197.119 milliseconds (cumulative count 629568)
6.426% <= 198.143 milliseconds (cumulative count 642568)
6.556% <= 199.167 milliseconds (cumulative count 655568)
6.706% <= 200.191 milliseconds (cumulative count 670568)
6.856% <= 201.215 milliseconds (cumulative count 685568)
6.966% <= 202.111 milliseconds (cumulative count 696568)
7.116% <= 203.135 milliseconds (cumulative count 711568)
7.256% <= 204.159 milliseconds (cumulative count 725568)
7.406% <= 205.183 milliseconds (cumulative count 740568)
7.546% <= 206.207 milliseconds (cumulative count 754568)
7.676% <= 207.103 milliseconds (cumulative count 767568)
7.686% <= 208.127 milliseconds (cumulative count 768568)
7.806% <= 210.175 milliseconds (cumulative count 780568)
7.856% <= 211.199 milliseconds (cumulative count 785568)
7.886% <= 212.223 milliseconds (cumulative count 788568)
7.916% <= 213.119 milliseconds (cumulative count 791568)
7.936% <= 214.143 milliseconds (cumulative count 793568)
7.966% <= 215.167 milliseconds (cumulative count 796568)
7.976% <= 216.191 milliseconds (cumulative count 797568)
7.986% <= 219.135 milliseconds (cumulative count 798568)
8.006% <= 220.159 milliseconds (cumulative count 800568)
8.036% <= 221.183 milliseconds (cumulative count 803568)
8.056% <= 222.207 milliseconds (cumulative count 805568)
8.086% <= 228.223 milliseconds (cumulative count 808568)
8.116% <= 229.119 milliseconds (cumulative count 811568)
8.126% <= 230.143 milliseconds (cumulative count 812568)
8.256% <= 236.159 milliseconds (cumulative count 825568)
8.436% <= 237.183 milliseconds (cumulative count 843568)
8.586% <= 238.207 milliseconds (cumulative count 858568)
8.716% <= 239.103 milliseconds (cumulative count 871568)
8.846% <= 240.127 milliseconds (cumulative count 884568)
8.966% <= 241.151 milliseconds (cumulative count 896568)
9.116% <= 242.175 milliseconds (cumulative count 911568)
9.216% <= 243.199 milliseconds (cumulative count 921568)
9.316% <= 244.223 milliseconds (cumulative count 931568)
9.466% <= 245.119 milliseconds (cumulative count 946568)
9.636% <= 246.143 milliseconds (cumulative count 963568)
9.806% <= 247.167 milliseconds (cumulative count 980568)
10.056% <= 248.191 milliseconds (cumulative count 1005568)
10.356% <= 249.215 milliseconds (cumulative count 1035568)
10.826% <= 250.111 milliseconds (cumulative count 1082568)
11.466% <= 251.135 milliseconds (cumulative count 1146568)
12.186% <= 252.159 milliseconds (cumulative count 1218568)
12.926% <= 253.183 milliseconds (cumulative count 1292568)
13.616% <= 254.207 milliseconds (cumulative count 1361568)
14.446% <= 255.103 milliseconds (cumulative count 1444568)
15.626% <= 256.127 milliseconds (cumulative count 1562568)
16.906% <= 257.151 milliseconds (cumulative count 1690568)
18.236% <= 258.175 milliseconds (cumulative count 1823568)
19.566% <= 259.199 milliseconds (cumulative count 1956568)
20.846% <= 260.223 milliseconds (cumulative count 2084568)
22.016% <= 261.119 milliseconds (cumulative count 2201568)
23.396% <= 262.143 milliseconds (cumulative count 2339568)
24.796% <= 263.167 milliseconds (cumulative count 2479568)
26.376% <= 264.191 milliseconds (cumulative count 2637568)
27.946% <= 265.215 milliseconds (cumulative count 2794568)
29.486% <= 266.239 milliseconds (cumulative count 2948568)
30.896% <= 267.263 milliseconds (cumulative count 3089568)
32.266% <= 268.287 milliseconds (cumulative count 3226568)
33.716% <= 269.311 milliseconds (cumulative count 3371568)
35.086% <= 270.335 milliseconds (cumulative count 3508568)
36.076% <= 271.103 milliseconds (cumulative count 3607568)
37.216% <= 272.127 milliseconds (cumulative count 3721568)
38.316% <= 273.151 milliseconds (cumulative count 3831568)
39.286% <= 274.175 milliseconds (cumulative count 3928568)
40.226% <= 275.199 milliseconds (cumulative count 4022568)
41.246% <= 276.223 milliseconds (cumulative count 4124568)
42.226% <= 277.247 milliseconds (cumulative count 4222568)
43.086% <= 278.271 milliseconds (cumulative count 4308568)
43.946% <= 279.295 milliseconds (cumulative count 4394568)
44.776% <= 280.319 milliseconds (cumulative count 4477568)
45.476% <= 281.343 milliseconds (cumulative count 4547568)
46.016% <= 282.111 milliseconds (cumulative count 4601568)
46.696% <= 283.135 milliseconds (cumulative count 4669568)
47.406% <= 284.159 milliseconds (cumulative count 4740568)
48.136% <= 285.183 milliseconds (cumulative count 4813568)
48.746% <= 286.207 milliseconds (cumulative count 4874568)
49.316% <= 287.231 milliseconds (cumulative count 4931568)
49.906% <= 288.255 milliseconds (cumulative count 4990568)
50.426% <= 289.279 milliseconds (cumulative count 5042568)
50.826% <= 290.303 milliseconds (cumulative count 5082568)
51.116% <= 291.327 milliseconds (cumulative count 5111568)
51.396% <= 292.351 milliseconds (cumulative count 5139568)
51.496% <= 293.119 milliseconds (cumulative count 5149568)
51.646% <= 294.143 milliseconds (cumulative count 5164568)
51.796% <= 295.167 milliseconds (cumulative count 5179568)
51.936% <= 296.191 milliseconds (cumulative count 5193568)
52.026% <= 297.215 milliseconds (cumulative count 5202568)
52.046% <= 301.311 milliseconds (cumulative count 5204568)
52.276% <= 304.127 milliseconds (cumulative count 5227568)
52.786% <= 305.151 milliseconds (cumulative count 5278568)
53.336% <= 306.175 milliseconds (cumulative count 5333568)
53.836% <= 307.199 milliseconds (cumulative count 5383568)
54.266% <= 308.223 milliseconds (cumulative count 5426568)
54.776% <= 309.247 milliseconds (cumulative count 5477568)
55.316% <= 310.271 milliseconds (cumulative count 5531568)
55.856% <= 311.295 milliseconds (cumulative count 5585568)
56.406% <= 312.319 milliseconds (cumulative count 5640568)
56.846% <= 313.343 milliseconds (cumulative count 5684568)
57.346% <= 314.111 milliseconds (cumulative count 5734568)
58.196% <= 315.135 milliseconds (cumulative count 5819568)
58.856% <= 316.159 milliseconds (cumulative count 5885568)
59.506% <= 317.183 milliseconds (cumulative count 5950568)
60.156% <= 318.207 milliseconds (cumulative count 6015568)
60.796% <= 319.231 milliseconds (cumulative count 6079568)
61.576% <= 320.255 milliseconds (cumulative count 6157568)
62.306% <= 321.279 milliseconds (cumulative count 6230568)
62.996% <= 322.303 milliseconds (cumulative count 6299568)
63.796% <= 323.327 milliseconds (cumulative count 6379568)
64.496% <= 324.351 milliseconds (cumulative count 6449568)
64.986% <= 325.119 milliseconds (cumulative count 6498568)
65.496% <= 326.143 milliseconds (cumulative count 6549568)
65.956% <= 327.167 milliseconds (cumulative count 6595568)
66.406% <= 328.191 milliseconds (cumulative count 6640568)
66.896% <= 329.215 milliseconds (cumulative count 6689568)
67.406% <= 330.239 milliseconds (cumulative count 6740568)
67.956% <= 331.263 milliseconds (cumulative count 6795568)
68.476% <= 332.287 milliseconds (cumulative count 6847568)
69.066% <= 333.311 milliseconds (cumulative count 6906568)
69.676% <= 334.335 milliseconds (cumulative count 6967568)
69.966% <= 335.103 milliseconds (cumulative count 6996568)
70.276% <= 336.127 milliseconds (cumulative count 7027568)
70.566% <= 337.151 milliseconds (cumulative count 7056568)
70.906% <= 338.175 milliseconds (cumulative count 7090568)
71.236% <= 339.199 milliseconds (cumulative count 7123568)
71.426% <= 340.223 milliseconds (cumulative count 7142568)
71.696% <= 341.247 milliseconds (cumulative count 7169568)
71.986% <= 342.271 milliseconds (cumulative count 7198568)
72.196% <= 343.295 milliseconds (cumulative count 7219568)
72.436% <= 344.319 milliseconds (cumulative count 7243568)
72.866% <= 345.343 milliseconds (cumulative count 7286568)
73.206% <= 346.111 milliseconds (cumulative count 7320568)
73.646% <= 347.135 milliseconds (cumulative count 7364568)
74.116% <= 348.159 milliseconds (cumulative count 7411568)
74.706% <= 349.183 milliseconds (cumulative count 7470568)
75.236% <= 350.207 milliseconds (cumulative count 7523568)
75.806% <= 351.231 milliseconds (cumulative count 7580568)
76.326% <= 352.255 milliseconds (cumulative count 7632568)
76.636% <= 353.279 milliseconds (cumulative count 7663568)
76.916% <= 354.303 milliseconds (cumulative count 7691568)
77.206% <= 355.327 milliseconds (cumulative count 7720568)
77.586% <= 356.351 milliseconds (cumulative count 7758568)
77.866% <= 357.119 milliseconds (cumulative count 7786568)
78.266% <= 358.143 milliseconds (cumulative count 7826568)
78.566% <= 359.167 milliseconds (cumulative count 7856568)
78.796% <= 360.191 milliseconds (cumulative count 7879568)
78.976% <= 361.215 milliseconds (cumulative count 7897568)
79.206% <= 362.239 milliseconds (cumulative count 7920568)
79.276% <= 363.263 milliseconds (cumulative count 7927568)
79.346% <= 364.287 milliseconds (cumulative count 7934568)
79.546% <= 365.311 milliseconds (cumulative count 7954568)
79.686% <= 366.335 milliseconds (cumulative count 7968568)
79.796% <= 367.103 milliseconds (cumulative count 7979568)
79.936% <= 368.127 milliseconds (cumulative count 7993568)
80.086% <= 369.151 milliseconds (cumulative count 8008568)
80.156% <= 370.175 milliseconds (cumulative count 8015568)
80.216% <= 371.199 milliseconds (cumulative count 8021568)
80.246% <= 372.223 milliseconds (cumulative count 8024568)
80.416% <= 373.247 milliseconds (cumulative count 8041568)
80.686% <= 374.271 milliseconds (cumulative count 8068568)
80.876% <= 375.295 milliseconds (cumulative count 8087568)
81.016% <= 376.319 milliseconds (cumulative count 8101568)
81.146% <= 377.343 milliseconds (cumulative count 8114568)
81.256% <= 378.111 milliseconds (cumulative count 8125568)
81.406% <= 379.135 milliseconds (cumulative count 8140568)
81.566% <= 380.159 milliseconds (cumulative count 8156568)
81.726% <= 381.183 milliseconds (cumulative count 8172568)
81.996% <= 382.207 milliseconds (cumulative count 8199568)
82.256% <= 383.231 milliseconds (cumulative count 8225568)
82.496% <= 384.255 milliseconds (cumulative count 8249568)
82.726% <= 385.279 milliseconds (cumulative count 8272568)
82.956% <= 386.303 milliseconds (cumulative count 8295568)
83.136% <= 387.327 milliseconds (cumulative count 8313568)
83.316% <= 388.351 milliseconds (cumulative count 8331568)
83.616% <= 389.119 milliseconds (cumulative count 8361568)
84.026% <= 390.143 milliseconds (cumulative count 8402568)
84.226% <= 391.167 milliseconds (cumulative count 8422568)
84.426% <= 392.191 milliseconds (cumulative count 8442568)
84.696% <= 393.215 milliseconds (cumulative count 8469568)
84.906% <= 394.239 milliseconds (cumulative count 8490568)
85.116% <= 395.263 milliseconds (cumulative count 8511568)
85.256% <= 396.287 milliseconds (cumulative count 8525568)
85.476% <= 397.311 milliseconds (cumulative count 8547568)
85.636% <= 398.335 milliseconds (cumulative count 8563568)
85.706% <= 399.103 milliseconds (cumulative count 8570568)
85.856% <= 400.127 milliseconds (cumulative count 8585568)
85.976% <= 401.151 milliseconds (cumulative count 8597568)
86.026% <= 403.199 milliseconds (cumulative count 8602568)
86.106% <= 404.223 milliseconds (cumulative count 8610568)
86.246% <= 405.247 milliseconds (cumulative count 8624568)
86.386% <= 406.271 milliseconds (cumulative count 8638568)
86.526% <= 407.295 milliseconds (cumulative count 8652568)
86.766% <= 408.319 milliseconds (cumulative count 8676568)
87.116% <= 409.343 milliseconds (cumulative count 8711568)
87.463% <= 410.111 milliseconds (cumulative count 8746272)
87.980% <= 411.135 milliseconds (cumulative count 8797952)
88.475% <= 412.159 milliseconds (cumulative count 8847472)
89.000% <= 413.183 milliseconds (cumulative count 8899992)
89.515% <= 414.207 milliseconds (cumulative count 8951512)
89.990% <= 415.231 milliseconds (cumulative count 8999032)
90.440% <= 416.255 milliseconds (cumulative count 9043984)
90.892% <= 417.279 milliseconds (cumulative count 9089232)
91.368% <= 418.303 milliseconds (cumulative count 9136752)
91.893% <= 419.327 milliseconds (cumulative count 9189272)
92.398% <= 420.351 milliseconds (cumulative count 9239792)
92.770% <= 421.119 milliseconds (cumulative count 9277040)
93.200% <= 422.143 milliseconds (cumulative count 9319992)
93.575% <= 423.167 milliseconds (cumulative count 9357512)
93.885% <= 424.191 milliseconds (cumulative count 9388464)
94.244% <= 425.215 milliseconds (cumulative count 9424416)
94.689% <= 426.239 milliseconds (cumulative count 9468936)
95.159% <= 427.263 milliseconds (cumulative count 9515888)
95.650% <= 428.287 milliseconds (cumulative count 9565000)
96.220% <= 429.311 milliseconds (cumulative count 9622000)
96.690% <= 430.335 milliseconds (cumulative count 9669000)
96.810% <= 431.103 milliseconds (cumulative count 9681000)
96.880% <= 432.127 milliseconds (cumulative count 9688000)
96.910% <= 435.199 milliseconds (cumulative count 9691000)
97.040% <= 436.223 milliseconds (cumulative count 9704000)
97.330% <= 437.247 milliseconds (cumulative count 9733000)
97.770% <= 438.271 milliseconds (cumulative count 9777000)
98.140% <= 439.295 milliseconds (cumulative count 9814000)
98.440% <= 440.319 milliseconds (cumulative count 9844000)
98.750% <= 441.343 milliseconds (cumulative count 9875000)
98.940% <= 442.111 milliseconds (cumulative count 9894000)
98.980% <= 446.207 milliseconds (cumulative count 9898000)
99.130% <= 447.231 milliseconds (cumulative count 9913000)
99.160% <= 448.255 milliseconds (cumulative count 9916000)
99.280% <= 451.327 milliseconds (cumulative count 9928000)
99.380% <= 452.351 milliseconds (cumulative count 9938000)
99.450% <= 453.119 milliseconds (cumulative count 9945000)
99.600% <= 454.143 milliseconds (cumulative count 9960000)
99.740% <= 455.167 milliseconds (cumulative count 9974000)
99.860% <= 456.191 milliseconds (cumulative count 9986000)
99.870% <= 470.271 milliseconds (cumulative count 9987000)
100.000% <= 471.295 milliseconds (cumulative count 10000000)

Summary:
  throughput summary: 1848340.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      304.421    27.008   288.511   427.007   446.463   471.295